In [1]:
import pandas as pd
student=pd.read_csv("student1.csv")
student

           NAME       ID  MARKS  GROUP
0       LAKSHMI  S180316     85    CSE
1          USHA  S180317     78    ECE
2  VENKATESWARI  S180318     82  CIVIL
3         VARAM  S180319     87    CSE
4       NAVEENA  S180320     83    EEE
5         NAVYA  S180321     88   MECH
6        VANAJA  S180322     87  CIVIL
7      USHA SRI  S180323     84    ECE

In [15]:
student.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   NAME    8 non-null      object
 1   ID      8 non-null      object
 2   MARKS   8 non-null      int64
 3   GROUP   8 non-null      object
dtypes: int64(1), object(3)
memory usage: 384.0+ bytes

pandas.core.frame.DataFrame

In [8]:
student.head(3)

           NAME       ID  MARKS  GROUP
0       LAKSHMI  S180316     85    CSE
1          USHA  S180317     78    ECE
2  VENKATESWARI  S180318     82  CIVIL

In [9]:
student.tail(3)

       NAME       ID  MARKS  GROUP
5     NAVYA  S180321     88   MECH
6    VANAJA  S180322     87  CIVIL
7  USHA SRI  S180323     84    ECE

In [11]:
student[["NAME","GROUP"]]

           NAME  GROUP
0       LAKSHMI    CSE
1          USHA    ECE
2  VENKATESWARI  CIVIL
3         VARAM    CSE
4       NAVEENA    EEE
5         NAVYA   MECH
6        VANAJA  CIVIL
7      USHA SRI    ECE

In [12]:
student.max()

NAME     VENKATESWARI
ID            S180323
MARKS              88
GROUP            MECH
dtype: object

In [14]:
student.min()

NAME     LAKSHMI
ID       S180316
MARKS         78
GROUP      CIVIL
dtype: object

In [16]:
type(student)

pandas.core.frame.DataFrame

In [17]:
student.MARKS.min()

78

In [18]:
student.MARKS.max()

88

In [20]:
student["NAME"]

0         LAKSHMI
1            USHA
2    VENKATESWARI
3           VARAM
4         NAVEENA
5           NAVYA
6          VANAJA
7        USHA SRI
Name: NAME, dtype: object

In [21]:
student["MARKS"].min()

78

In [22]:
student["MARKS"]>85

0    False
1    False
2    False
3     True
4    False
5     True
6     True
7    False
Name: MARKS, dtype: bool

In [24]:
student[student["MARKS"]>85]

     NAME       ID  MARKS  GROUP
3   VARAM  S180319     87    CSE
5   NAVYA  S180321     88   MECH
6  VANAJA  S180322     87  CIVIL